## Production: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_docdb_cluster_parameter_group.ai-answers-docdb-cluster-parameter-group will be created
  + resource "aws_docdb_cluster_parameter_group" "ai-answers-docdb-cluster-parameter-group" {
      + arn         = (known after apply)
      + description = "Parameter group for ai-answers production DocumentDB"
      + family      = "docdb5.0"
      + id          = (known after apply)
      + name        = "ai-answers-production-docdb-cluster-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }

      + parameter {
          + apply_method = "pending-reboot"
          + name         = "tls"
          + value        = "enabled"
        }
    }

  # aws_docdb_subnet_group.ai-answers-docdb-subnet-group will be created
  + resource "aws_docdb_subnet_group" "ai-answers-docdb-subnet-group" {
      + arn         = (known after apply)
      + description = "Subnet group for DocumentDB for the ai-answers production app"
      + id          = (known after apply)
      + name        = "ai-answers-production-docdb-subnet-group"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + null,
        ]
      + tags        = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "ai-answers-prod"
          + "Terraform"  = "true"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
[0;90m17:57:44.291[0m [0;33mWARN  [0m Config ../ssm/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
[0;90m17:57:44.293[0m [0;33mWARN  [0m Config ../network/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.

Error: reading SSM Parameter (): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: e9f831d1-452b-4002-82dd-9e1ed1a78b03, api error ValidationException: 1 validation error detected: Value '' at 'name' failed to satisfy constraint: Member must have length greater than or equal to 1

  with data.aws_ssm_parameter.docdb_username,
  on documentdb.tf line 6, in data "aws_ssm_parameter" "docdb_username":
   6: data "aws_ssm_parameter" "docdb_username" {


Error: reading SSM Parameter (): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 41ee5b6f-0803-4459-a5eb-76ea76fe815d, api error ValidationException: 1 validation error detected: Value '' at 'name' failed to satisfy constraint: Member must have length greater than or equal to 1

  with data.aws_ssm_parameter.docdb_password,
  on documentdb.tf line 10, in data "aws_ssm_parameter" "docdb_password":
  10: data "aws_ssm_parameter" "docdb_password" {


Error: "" is not a valid CIDR block: invalid CIDR address: 

  with aws_security_group.ai-answers-docdb-sg,
  on documentdb.tf line 15, in resource "aws_security_group" "ai-answers-docdb-sg":
  15: resource "aws_security_group" "ai-answers-docdb-sg" {


Error: "" is not a valid CIDR block: invalid CIDR address: 

  with aws_security_group.ai-answers-docdb-sg,
  on documentdb.tf line 15, in resource "aws_security_group" "ai-answers-docdb-sg":
  15: resource "aws_security_group" "ai-answers-docdb-sg" {

[0;90m17:57:47.629[0m [0;31mERROR [0m terraform invocation failed in ./.terragrunt-cache/954bzlnFUpJEyWl9QonYlNuEs5Y/HZ1Dre01zncVe6gY3u5Io4to-Mc/database
[0;90m17:57:47.629[0m [0;31mERROR [0m error occurred:

* Failed to execute "terraform plan -no-color -input=false -out=plan.tfplan" in ./.terragrunt-cache/954bzlnFUpJEyWl9QonYlNuEs5Y/HZ1Dre01zncVe6gY3u5Io4to-Mc/database
  
  Error: reading SSM Parameter (): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: e9f831d1-452b-4002-82dd-9e1ed1a78b03, api error ValidationException: 1 validation error detected: Value '' at 'name' failed to satisfy constraint: Member must have length greater than or equal to 1
  
    with data.aws_ssm_parameter.docdb_username,
    on documentdb.tf line 6, in data "aws_ssm_parameter" "docdb_username":
     6: data "aws_ssm_parameter" "docdb_username" {
  
  
  Error: reading SSM Parameter (): operation error SSM: GetParameter, https response error StatusCode: 400, RequestID: 41ee5b6f-0803-4459-a5eb-76ea76fe815d, api error ValidationException: 1 validation error detected: Value '' at 'name' failed to satisfy constraint: Member must have length greater than or equal to 1
  
    with data.aws_ssm_parameter.docdb_password,
    on documentdb.tf line 10, in data "aws_ssm_parameter" "docdb_password":
    10: data "aws_ssm_parameter" "docdb_password" {
  
  
  Error: "" is not a valid CIDR block: invalid CIDR address: 
  
    with aws_security_group.ai-answers-docdb-sg,
    on documentdb.tf line 15, in resource "aws_security_group" "ai-answers-docdb-sg":
    15: resource "aws_security_group" "ai-answers-docdb-sg" {
  
  
  Error: "" is not a valid CIDR block: invalid CIDR address: 
  
    with aws_security_group.ai-answers-docdb-sg,
    on documentdb.tf line 15, in resource "aws_security_group" "ai-answers-docdb-sg":
    15: resource "aws_security_group" "ai-answers-docdb-sg" {
  
  
  exit status 1


```

</details>

